<a href="https://colab.research.google.com/github/sirishaallarapu/AdvancedPySpark-/blob/main/Day2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import os
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, avg, sum

os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-11-openjdk-amd64"

spark = SparkSession.builder.appName("EmployeeOperations").getOrCreate()

employee_data = [
    (301, "Rajesh", "Finance", 65000),
    (302, "Sunita", "IT", 72000),
    (303, "Manoj", "Marketing", 55000),
    (304, "Anjali", "HR", 53000),
    (305, "Tarun", "IT", 78000),
    (306, "Pooja", "Operations", 60000)
]
employee_columns = ["Emp_ID", "Name", "Department", "Salary"]
df_emp = spark.createDataFrame(employee_data, employee_columns)

df_emp.groupBy("Department").agg(avg("Salary").alias("Avg_Salary"), sum("Salary").alias("Total_Salary")).show()

df_emp.orderBy(col("Salary").asc()).show()
df_emp.orderBy(col("Salary").desc()).show()

customer_data = [
    (201, "Vikas", "Pune"),
    (202, "Kavita", "Chennai"),
    (203, "Sandeep", "Kolkata"),
    (204, "Meghna", "Jaipur")
]
customer_columns = ["customer_id", "customer_name", "city"]
df_customers = spark.createDataFrame(customer_data, customer_columns)

order_data = [
    (601, 201, "Smartphone", 45000),
    (602, 203, "Washing Machine", 30000),
    (603, 202, "Refrigerator", 35000),
    (604, 205, "Microwave", 10000)
]
order_columns = ["order_id", "customer_id", "product", "amount"]
df_orders = spark.createDataFrame(order_data, order_columns)

df_customers.join(df_orders, on="customer_id", how="inner").show()

spark.stop()

+----------+----------+------------+
|Department|Avg_Salary|Total_Salary|
+----------+----------+------------+
|   Finance|   65000.0|       65000|
| Marketing|   55000.0|       55000|
|        IT|   75000.0|      150000|
|        HR|   53000.0|       53000|
|Operations|   60000.0|       60000|
+----------+----------+------------+

+------+------+----------+------+
|Emp_ID|  Name|Department|Salary|
+------+------+----------+------+
|   304|Anjali|        HR| 53000|
|   303| Manoj| Marketing| 55000|
|   306| Pooja|Operations| 60000|
|   301|Rajesh|   Finance| 65000|
|   302|Sunita|        IT| 72000|
|   305| Tarun|        IT| 78000|
+------+------+----------+------+

+------+------+----------+------+
|Emp_ID|  Name|Department|Salary|
+------+------+----------+------+
|   305| Tarun|        IT| 78000|
|   302|Sunita|        IT| 72000|
|   301|Rajesh|   Finance| 65000|
|   306| Pooja|Operations| 60000|
|   303| Manoj| Marketing| 55000|
|   304|Anjali|        HR| 53000|
+------+------+----------+------+

+-----------+-------------+-------+--------+---------------+------+
|customer_id|customer_name|   city|order_id|        product|amount|
+-----------+-------------+-------+--------+---------------+------+
|        201|        Vikas|   Pune|     601|     Smartphone| 45000|
|        202|       Kavita|Chennai|     603|   Refrigerator| 35000|
|        203|      Sandeep|Kolkata|     602|Washing Machine| 30000|
+-----------+-------------+-------+--------+---------------+------+

In [ ]:
import os
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, count, max, min, round

os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-11-openjdk-amd64"

spark = SparkSession.builder.appName("PySparkExamples").getOrCreate()

student_data = [
    (101, "Aarav", "Math", 85),
    (102, "Ishika", "Science", 78),
    (103, "Rohan", "Math", 92),
    (104, "Meera", "English", 88),
    (105, "Neel", "Science", 74),
    (106, "Tanvi", "English", 91),
    (107, "Vihan", "Math", 89),
    (108, "Sneha", "Science", 81)
]
student_columns = ["Student_ID", "Name", "Subject", "Marks"]
df_students = spark.createDataFrame(student_data, student_columns)

df_students.groupBy("Subject").agg(round(avg("Marks"), 2).alias("Avg_Marks"), max("Marks").alias("Max_Marks"), min("Marks").alias("Min_Marks")).show()

df_students.orderBy(col("Marks").asc()).show()
df_students.orderBy(col("Marks").desc()).show()

book_data = [
    (201, "Ramayana", "Valmiki"),
    (202, "Mahabharata", "Vyasa"),
    (203, "Wings of Fire", "APJ Abdul Kalam"),
    (204, "The Guide", "R.K. Narayan"),
    (205, "Gitanjali", "Rabindranath Tagore")
]
book_columns = ["Book_ID", "Title", "Author"]
df_books = spark.createDataFrame(book_data, book_columns)

borrow_data = [
    (301, 201, "Aarav"),
    (302, 203, "Ishika"),
    (303, 202, "Rohan"),
    (304, 204, "Meera"),
    (305, 205, "Tanvi"),
    (306, 206, "Neel")
]
borrow_columns = ["Transaction_ID", "Book_ID", "Student_Name"]
df_borrow = spark.createDataFrame(borrow_data, borrow_columns)

df_books.join(df_borrow, on="Book_ID", how="inner").show()

spark.stop()

+-------+---------+---------+---------+
|Subject|Avg_Marks|Max_Marks|Min_Marks|
+-------+---------+---------+---------+
|Science|    77.67|       81|       74|
|   Math|    88.67|       92|       85|
|English|     89.5|       91|       88|
+-------+---------+---------+---------+

+----------+------+-------+-----+
|Student_ID|  Name|Subject|Marks|
+----------+------+-------+-----+
|       105|  Neel|Science|   74|
|       102|Ishika|Science|   78|
|       108| Sneha|Science|   81|
|       101| Aarav|   Math|   85|
|       104| Meera|English|   88|
|       107| Vihan|   Math|   89|
|       106| Tanvi|English|   91|
|       103| Rohan|   Math|   92|
+----------+------+-------+-----+

+----------+------+-------+-----+
|Student_ID|  Name|Subject|Marks|
+----------+------+-------+-----+
|       103| Rohan|   Math|   92|
|       106| Tanvi|English|   91|
|       107| Vihan|   Math|   89|
|       104| Meera|English|   88|
|       101| Aarav|   Math|   85|
|       108| Sneha|Science|   81|
|       102|Ishika|Science|   78|
|       105|  Neel|Science|   74|
+----------+------+-------+-----+

+-------+-------------+-------------------+--------------+------------+
|Book_ID|        Title|             Author|Transaction_ID|Student_Name|
+-------+-------------+-------------------+--------------+------------+
|    201|     Ramayana|            Valmiki|           301|       Aarav|
|    202|  Mahabharata|              Vyasa|           303|       Rohan|
|    203|Wings of Fire|    APJ Abdul Kalam|           302|      Ishika|
|    204|    The Guide|       R.K. Narayan|           304|       Meera|
|    205|    Gitanjali|Rabindranath Tagore|           305|       Tanvi|
+-------+-------------+-------------------+--------------+------------+

In [ ]:
import os
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, count, avg, max, min

os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-11-openjdk-amd64"

spark = SparkSession.builder.appName("PySparkExamples").getOrCreate()

vehicle_data = [
    (1, "Hyundai", "Sedan", 15000),
    (2, "Toyota", "SUV", 22000),
    (3, "Honda", "Sedan", 18000),
    (4, "Ford", "Truck", 25000),
    (5, "Tata", "SUV", 20000),
    (6, "Mahindra", "Truck", 27000),
    (7, "Maruti", "Hatchback", 12000),
    (8, "Kia", "SUV", 23000)
]
vehicle_columns = ["Vehicle_ID", "Brand", "Category", "Price"]
df_vehicles = spark.createDataFrame(vehicle_data, vehicle_columns)

df_vehicles.groupBy("Category").agg(count("Vehicle_ID").alias("Total_Vehicles"), avg("Price").alias("Avg_Price"), max("Price").alias("Max_Price"), min("Price").alias("Min_Price")).show()

df_vehicles.orderBy(col("Price").asc()).show()
df_vehicles.orderBy(col("Price").desc()).show()

dealer_data = [
    (101, "Auto World", "Mumbai"),
    (102, "Speed Motors", "Delhi"),
    (103, "Highway Cars", "Bangalore"),
    (104, "Urban Wheels", "Pune")
]
dealer_columns = ["Dealer_ID", "Dealer_Name", "City"]
df_dealers = spark.createDataFrame(dealer_data, dealer_columns)

sales_data = [
    (201, 101, "Hyundai", 10),
    (202, 103, "Toyota", 8),
    (203, 102, "Honda", 12),
    (204, 104, "Ford", 5),
    (205, 101, "Tata", 7),
    (206, 103, "Mahindra", 6)
]
sales_columns = ["Sale_ID", "Dealer_ID", "Brand", "Units_Sold"]
df_sales = spark.createDataFrame(sales_data, sales_columns)

df_dealers.join(df_sales, on="Dealer_ID", how="inner").show()

spark.stop()

+---------+--------------+------------------+---------+---------+
| Category|Total_Vehicles|         Avg_Price|Max_Price|Min_Price|
+---------+--------------+------------------+---------+---------+
|      SUV|             3|21666.666666666668|    23000|    20000|
|    Sedan|             2|           16500.0|    18000|    15000|
|    Truck|             2|           26000.0|    27000|    25000|
|Hatchback|             1|           12000.0|    12000|    12000|
+---------+--------------+------------------+---------+---------+

+----------+--------+---------+-----+
|Vehicle_ID|   Brand| Category|Price|
+----------+--------+---------+-----+
|         7|  Maruti|Hatchback|12000|
|         1| Hyundai|    Sedan|15000|
|         3|   Honda|    Sedan|18000|
|         5|    Tata|      SUV|20000|
|         2|  Toyota|      SUV|22000|
|         8|     Kia|      SUV|23000|
|         4|    Ford|    Truck|25000|
|         6|Mahindra|    Truck|27000|
+----------+--------+---------+-----+

+----------+--------+---------+-----+
|Vehicle_ID|   Brand| Category|Price|
+----------+--------+---------+-----+
|         6|Mahindra|    Truck|27000|
|         4|    Ford|    Truck|25000|
|         8|     Kia|      SUV|23000|
|         2|  Toyota|      SUV|22000|
|         5|    Tata|      SUV|20000|
|         3|   Honda|    Sedan|18000|
|         1| Hyundai|    Sedan|15000|
|         7|  Maruti|Hatchback|12000|
+----------+--------+---------+-----+

+---------+------------+---------+-------+--------+----------+
|Dealer_ID| Dealer_Name|     City|Sale_ID|   Brand|Units_Sold|
+---------+------------+---------+-------+--------+----------+
|      101|  Auto World|   Mumbai|    201| Hyundai|        10|
|      101|  Auto World|   Mumbai|    205|    Tata|         7|
|      102|Speed Motors|    Delhi|    203|   Honda|        12|
|      103|Highway Cars|Bangalore|    202|  Toyota|         8|
|      103|Highway Cars|Bangalore|    206|Mahindra|         6|
|      104|Urban Wheels|     Pune|    204|    Ford|         5|
+---------+------------+---------+-------+--------+----------+